problems met/latex/chinese_fontawesome_color.zh.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh" xml:lang="zh">
<head>
<title>LaTex 中使用中文，fontawesome和自定义颜色</title>
<!-- 2017-02-14 Tue 22:43 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="施君君" />
</head>
<body>
<div id="content">
<h1 class="title">LaTex 中使用中文，fontawesome和自定义颜色</h1>
<p>
我在这里是使用的Macbook Air,系统是10.11.6,MacTex 2016。使用XeLaTex进行编译。
</p>
<ol class="org-ol">
<li>下如何在LaTex中使用中文
在learnxinyminutes中的LaTex直接编译会缺失中文字符。(其实是随便写一点东西占个位置。)
<div class="org-src-container">

<pre class="src src-latex">\usepackage[UTF8]{ctex}
\usepackage{CJKutf8}
</pre>
</div>
<p>
我是使用的上面的一种方式来支持中文字符的，第二种理论上来说可以但是我没有试过。
注意:使用的是xelatex进行编译
</p>
</li>

<li>使用fontawesome
在我的系统环境下尝试使用fontawesome的时候提示找不到字体文件，根据网上的资料，手动添加Path然后加载fontawesome
<div class="org-src-container">

<pre class="src src-latex">\usepackage{fontspec}
\defaultfontfeatures{
    Path = /usr/local/texlive/2016/texmf-dist/fonts/opentype/public/fontawesome/ }
\usepackage{fontawesome}
</pre>
</div>
<p>
我使用的是2016版的MacTex，可以根据安装的版本直接更改当中的数字应该就可以用了。
</p>
</li>

<li>自定义颜色
我在使用的时候，有颜色找不到，所以使用自定义的颜色，在这里放一下颜色对应的代码的地址:<a href="http://latexcolor.com/">http://latexcolor.com/</a>
<div class="org-src-container">

<pre class="src src-latex">\usepackage{color}
\definecolor{mustard}{rgb}{1.0, 0.86, 0.35}
\color{mustard}Mustard
</pre>
</div>
<p>
在示例中我是定义了mustard芥末色&#x2013;黄芥末，然后使用这种颜色，定义之后，使用起来与原生的颜色没什么区别。
</p>
</li>

<li>再说一点
我是在写简历的时候遇到的这些问题，使用的modernCV的模板，所以再来简单说一下其他相关的小细节:
<ol class="org-ol">
<li>文档有时候感觉周围空太多，比如你分两列的时候，左边太窄了
<div class="org-src-container">

<pre class="src src-latex">\setlength{\hintscolumnwidth}{0.15\textwidth}
</pre>
</div>
</li>
<li>在简历上添加Github小图标，我就是因为这个所以才用了fontawesome那个包，里面有现成的许多图标
<div class="org-src-container">

<pre class="src src-latex">\extrainfo{\faGithub \href{https://github.com/[你的用户名]}{github.com/[你的用户名]}}
</pre>
</div>
<p>
可以像我这样，将信息和电话号码什么的放在一起，那该有的地方就都会有了
</p>
</li>
</ol>
</li>
</ol>

<p>
写完了，去写英文版了，不知效果怎么样
</p>
</div>
<div id="postamble" class="status">
<p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">&lt;2017-02-14 Tue&gt;</span></span></p>
<p class="author">Author: 施君君</p>
<p class="date">Created: 2017-02-14 Tue 22:43</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
